<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用行为扩展定义文件
return [
    'mark_log' => ['app\\admin\\hook\\Log'],
    'email' => ['app\\admin\\hook\\Email']
    //一个钩子可以注册多个行为，执行到某个钩子位置后，会按照注册的顺序依次执行相关的行为。但在某些特殊的情况下，你可以设置某个钩子只能执行一次行为，又或者你可以在一个钩子的某个行为中返回 false来强制终止后续的行为执行；一个行为可以同时注册到多个不同的钩子上，完全看应用的需求来设计

];
